{
  "backend/main.mo": "Motoko canister defining products, inventory, sales, users, cash transactions, and authorization with storage mixins and various CRUD/state types.",
  "feature_evidence.json": "Feature evidence report listing two frontend feature requirements tied to ProductFormModal updates with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend files including pages, hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base/theme variable definitions providing OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React shell managing views, providing QueryClient, rendering pages, navbar, and footer with attribution.",
  "frontend/src/components/AdjustStockModal.tsx": "Modal for adding or reducing inventory stock with validation, error normalization, and backend mutation calls.",
  "frontend/src/components/Dashboard.tsx": "Dashboard displaying sales summary, payment totals, low‑stock detection with auto dialog, and error/auth handling.",
  "frontend/src/components/EditInventoryItemModal.tsx": "Modal for editing an inventory item, handling validation, duplicate checks, and update mutations.",
  "frontend/src/components/EditSaleModal.tsx": "Modal for editing a sale record, allowing item modifications, validation, and submitting updated sale data.",
  "frontend/src/components/InventoryFormModal.tsx": "Form modal for adding new inventory items with duplicate checks, stock calculations, and input validation.",
  "frontend/src/components/InventoryPage.tsx": "Main inventory management page showing stock list, handling modals, error states, and low‑stock logic.",
  "frontend/src/components/InventoryReportPage.tsx": "Displays inventory adjustment history with error handling and a sortable report list.",
  "frontend/src/components/LowStockWarningDialog.tsx": "Dialog showing items that have reached or fallen below minimum stock levels.",
  "frontend/src/components/Navbar.tsx": "Renders the main navigation bar with menu items, including a dropdown for report views, and triggers view changes.",
  "frontend/src/components/ProductFormModal.tsx": "Provides a modal form to add products, handling image upload, validation, and backend submission.",
  "frontend/src/components/ProductsPage.tsx": "Displays the product catalog with loading and error states, and includes controls to add products and navigate back.",
  "frontend/src/components/QuantityPromptModal.tsx": "Prompts the user to enter a quantity for a selected product and shows price calculations before confirming.",
  "frontend/src/components/QueryErrorState.tsx": "Shows a styled error message with retry functionality based on normalized error details.",
  "frontend/src/components/SalesReportPage.tsx": "Displays sales report data with date filtering, editing/deleting sales, and export-to-XLS features.",
  "frontend/src/components/SignInRequiredState.tsx": "Shows a sign‑in prompt for Internet Identity when authentication is required to access content.",
  "frontend/src/components/StockDeductionRulesModal.tsx": "Placeholder file with no implementation.",
  "frontend/src/components/TransactionPage.tsx": "Implements a two-step cart and payment flow, allowing product selection, quantity input, cart management, and sale submission. Integrates product data, identity, and sale recording via hooks.",
  "frontend/src/constants/productOptions.ts": "Defines constant lists of product categories, sizes, and names along with associated TypeScript types. Used for product creation and stock rule configuration.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous backend actor tied to Internet Identity and refreshes dependent queries on identity change. Provides global access to the active actor instance.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller’s backend-defined user role with safe fallbacks and warns against using it for any UI access control. Always returns a non-breaking 'user' default role.",
  "frontend/src/hooks/useDashboardSummary.ts": "Fetches dashboard summary data from the backend using the authenticated actor. Enabled once the actor is available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login flow, stored identities, and provides identity context to the app. Wraps Dfinity AuthClient with custom initialization logic.",
  "frontend/src/hooks/useInvalidateActorQueries.ts": "Provides a helper to invalidate all queries related to the backend actor. Used to force-refresh actor-dependent queries after failures.",
  "frontend/src/hooks/useInventory.ts": "Fetches inventory items and provides mutations for adding, updating, and adjusting stock. Invalidates inventory queries after successful mutations.",
  "frontend/src/hooks/useInventoryReport.ts": "Retrieves inventory history reports using a public actor with optional filtering and time-range parameters. Refetches automatically when parameters change.",
  "frontend/src/hooks/useProducts.ts": "Fetches product list and provides a mutation for adding new products. Invalidates the products query on successful creation.",
  "frontend/src/hooks/usePublicActor.ts": "Creates and manages an anonymous backend actor, refetching dependent queries when it changes. Used for public, unauthenticated data access.",
  "frontend/src/hooks/useRecordSale.ts": "Provides a mutation to record new sales with items and payment method. Invalidates dashboard and inventory queries on success.",
  "frontend/src/hooks/useSalesMutations.ts": "Provides mutations for updating and deleting sales, invalidating sales report and dashboard queries after success. Uses the authenticated actor.",
  "frontend/src/hooks/useSalesReport.ts": "Fetches sales records for a given timestamp range using the authenticated actor. Supports reactive refetch via query keys.",
  "frontend/src/hooks/useStockDeductionRules.ts": "File exists but contains no implementation.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/utils/errorMessage.ts": "Normalizes various backend error messages into user‑friendly titles and flags auth errors.",
  "frontend/src/utils/exportToXls.ts": "Generates an HTML-based Excel file from sales line items and triggers a download.",
  "frontend/src/utils/inventoryName.ts": "Provides helpers to normalize inventory item names and detect duplicates.",
  "frontend/src/utils/salesFormat.ts": "Formats currency, dates, and payment method labels for sales data.",
  "frontend/src/utils/urlParams.ts": "Manages URL and sessionStorage parameters with helpers for extracting, persisting, and clearing values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, animations, and plugins.",
  "project_state.json": "Stores project metadata, features, and pending requests for the Product Catalog app."
}