{
  "backend/main.mo": "Main canister actor defining products, inventory, sales, user profiles, and access‑controlled CRUD methods with storage mixins and migration support.",
  "backend/migration.mo": "Migration module converting old sales records to a new schema with added fields like COGS, productName, and totalTax.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference file containing human-written summaries of multiple frontend source files for build planning.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark mode color tokens and layout styles.",
  "frontend/index.html": "Root HTML document loading the main React entry point.",
  "frontend/src/App.tsx": "React app shell managing view switching and rendering pages including the new SalesReportPage.",
  "frontend/src/components/AdjustStockModal.tsx": "Modal for adjusting inventory stock with validation, backend mutation, and normalized error handling.",
  "frontend/src/components/Dashboard.tsx": "Displays dashboard summary cards and payment method totals with loading and error states.",
  "frontend/src/components/EditInventoryItemModal.tsx": "Modal for editing an inventory item with validation, duplicate checks, and update mutation handling.",
  "frontend/src/components/EditSaleModal.tsx": "Modal for editing a sale’s payment method and items, including validation and submission to update the record.",
  "frontend/src/components/InventoryFormModal.tsx": "Form modal for adding new inventory items with validation, duplicate checks, and stock calculation.",
  "frontend/src/components/InventoryPage.tsx": "Main inventory page displaying items, handling add/edit/adjust modals, and managing loading and error states.",
  "frontend/src/components/Navbar.tsx": "Top navigation bar with logo, main menu items, and dropdown submenu for reports, handling view changes.",
  "frontend/src/components/ProductFormModal.tsx": "Modal form for adding products, including validation and image upload handling.",
  "frontend/src/components/ProductsPage.tsx": "Page displaying product list with loading/error states and a modal to add new products.",
  "frontend/src/components/QuantityPromptModal.tsx": "Modal prompting for product quantity and showing subtotal before confirming.",
  "frontend/src/components/QueryErrorState.tsx": "Reusable error display component with retry handling and special messaging for auth or actor errors.",
  "frontend/src/components/SalesReportPage.tsx": "Sales report page with date filtering, editing/deleting sales, table rendering, and XLS export.",
  "frontend/src/components/TransactionPage.tsx": "UI for building a cart, selecting quantities, choosing payment, and submitting a sale via recordSale.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller's backend role with a safe fallback and avoids breaking UI when unavailable.",
  "frontend/src/hooks/useDashboardSummary.ts": "Loads dashboard summary data from the backend using the current actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context via Internet Identity, including login, logout, and identity persistence.",
  "frontend/src/hooks/useInventory.ts": "Fetches inventory items and provides mutations to add, update, and adjust stock, with query invalidation.",
  "frontend/src/hooks/useProducts.ts": "Loads product list and allows adding new products, refreshing the products query on success.",
  "frontend/src/hooks/useRecordSale.ts": "Records a new sale and refreshes dashboard summary after mutation.",
  "frontend/src/hooks/useSalesMutations.ts": "Provides update and delete mutations for sales, invalidating related queries on success.",
  "frontend/src/hooks/useSalesReport.ts": "Queries sales records for a given time range using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes React, query client, identity provider, and renders the main App.",
  "frontend/src/utils/exportToXls.ts": "Generates an HTML-based Excel file containing sales report rows and triggers a download of the .xls file.",
  "frontend/src/utils/inventoryName.ts": "Provides helpers to normalize inventory item names and check for duplicates with optional ID exclusion.",
  "frontend/src/utils/salesFormat.ts": "Formats currency and dates for Indonesian locale and maps payment method codes to display labels.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "Project state file describing scope, UI requirements, architecture notes, and current known issues."
}