{
  "backend/main.mo": "Main canister implementing product, inventory, sales, user profile, cash transaction, and report management with authorization and storage mixins.",
  "backend/migration.mo": "Migration logic converting old products to new format by adding the hpp field with a default value of 0.",
  "feature_evidence.json": "Feature evidence report listing feature requirements, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components and hooks.",
  "frontend/index.css": "Global Tailwind-based CSS theme defining color tokens, dark mode values, and base styles.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling navigation between views and wrapping the app in a QueryClientProvider.",
  "frontend/src/components/AdjustStockModal.tsx": "Modal form for adjusting inventory stock with quantity/description validation and backend mutation handling.",
  "frontend/src/components/Dashboard.tsx": "Dashboard component showing sales summary, payment totals, and low‑stock inventory warnings with loading, error, and auth states.",
  "frontend/src/components/EditInventoryItemModal.tsx": "Modal for editing an inventory item with validation, duplicate checks, and mutation submission.",
  "frontend/src/components/EditSaleModal.tsx": "Modal for editing a sale, allowing item updates, payment method changes, validation, and submitting sale mutations.",
  "frontend/src/components/InventoryFormModal.tsx": "Modal to add new inventory items with validation, duplicate detection, and auto‑calculation of final stock.",
  "frontend/src/components/InventoryPage.tsx": "Inventory management page listing items with add, edit, and stock‑adjustment modals plus loading and error handling.",
  "frontend/src/components/InventoryReportPage.tsx": "Displays inventory adjustment history with error handling, loading states, and a sortable reports table.",
  "frontend/src/components/LowStockWarningDialog.tsx": "Shows a dialog listing items that are below minimum stock, using a scrollable table layout.",
  "frontend/src/components/Navbar.tsx": "Renders the main navigation bar with dropdown menus and view switching logic.",
  "frontend/src/components/ProductFormModal.tsx": "Provides a modal form to add new products, including image upload, validation, and authentication-aware error handling.",
  "frontend/src/components/ProductsPage.tsx": "Displays product listings with loading and error states, supports adding products via a modal, and handles auth-related access.",
  "frontend/src/components/QuantityPromptModal.tsx": "Modal prompting the user for a product quantity and showing subtotal calculations.",
  "frontend/src/components/QueryErrorState.tsx": "Generic error display component with normalized messaging and retry support.",
  "frontend/src/components/SalesReportPage.tsx": "Page component that fetches, filters, displays, exports, edits, and deletes sales records in a tabular report format. Handles date filtering, XLS export, and sale mutation modals.",
  "frontend/src/components/SignInRequiredState.tsx": "UI component showing a sign‑in prompt with Internet Identity integration. Displays login status and triggers the login flow.",
  "frontend/src/components/StockDeductionRulesModal.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/TransactionPage.tsx": "Handles product selection, cart management, payment selection, and submitting sales transactions. Integrates product fetching, identity checks, and sale recording mutations.",
  "frontend/src/constants/productOptions.ts": "Exports constant lists of product categories, sizes, and standardized product names plus associated TypeScript types.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, handling initialization and invalidating related queries when the actor changes.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller's role from the backend with safe fallbacks, intentionally avoiding any UI gating logic.",
  "frontend/src/hooks/useDashboardSummary.ts": "Retrieves dashboard summary data from the backend using the authenticated actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities, handling login flows, and exposing identity state.",
  "frontend/src/hooks/useInvalidateActorQueries.ts": "Utility hook that invalidates all queries related to actor instances.",
  "frontend/src/hooks/useInventory.ts": "Hooks for listing, adding, updating, and adjusting inventory items via backend actor methods with query invalidation.",
  "frontend/src/hooks/useInventoryReport.ts": "Provides a query hook to fetch inventory report entries with optional filters and day range.",
  "frontend/src/hooks/useProducts.ts": "Exposes hooks to fetch products and add new products, invalidating product queries on changes.",
  "frontend/src/hooks/usePublicActor.ts": "Creates and manages an anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useRecordSale.ts": "Mutation hook to record a sale and invalidate dashboard and inventory data afterward.",
  "frontend/src/hooks/useSalesMutations.ts": "Contains mutations to update or delete sales and refresh related reports on success.",
  "frontend/src/hooks/useSalesReport.ts": "Fetches sales records within a timestamp range using the authenticated actor.",
  "frontend/src/hooks/useStockDeductionRules.ts": "Empty file with no implementation.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/errorMessage.ts": "Normalizes various backend error messages into user-friendly formats with auth detection.",
  "frontend/src/utils/exportToXls.ts": "Converts sales report data into an HTML-based XLS file and triggers a client-side download.",
  "frontend/src/utils/inventoryName.ts": "Provides helpers to normalize inventory names and detect duplicates in a list.",
  "frontend/src/utils/salesFormat.ts": "Utility functions for formatting currency, dates, and payment method labels.",
  "frontend/src/utils/urlParams.ts": "Handles extracting, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, animations, themes, and plugin setup.",
  "project_state.json": "Stores project metadata, existing feature definitions, and new feature requests for the Product Catalog. Includes schema versioning, project state details, and pending requirements such as HPP migration and fixed dropdown updates."
}