{
  "backend/main.mo": "Motoko canister implementing products, inventory, sales, and user profiles with access control and CRUD operations.",
  "feature_evidence.json": "Feature evidence report linking a frontend error‑handling improvement to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend files including components, hooks, utilities, and type definitions.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables and light/dark theme styles for global UI.",
  "frontend/index.html": "HTML entry file mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app managing view switching and providing React Query context with a navbar and footer.",
  "frontend/src/components/AdjustStockModal.tsx": "Modal for adjusting inventory stock with validation, backend mutation, and normalized error messages.",
  "frontend/src/components/Dashboard.tsx": "Dashboard fetching and displaying sales summary with formatted metrics and improved actor‑retry error handling.",
  "frontend/src/components/EditInventoryItemModal.tsx": "Modal for editing inventory items, with form validation, duplicate checks, and mutation to update items.",
  "frontend/src/components/InventoryFormModal.tsx": "Modal for creating new inventory items, including validation, duplicate checks, and automatic final stock calculation.",
  "frontend/src/components/InventoryPage.tsx": "Main inventory management page showing inventory list, loading/error states, and controls for adding, editing, and adjusting stock.",
  "frontend/src/components/Navbar.tsx": "Top navigation bar with menu items, icons, and a dropdown for reports, allowing view switching.",
  "frontend/src/components/ProductFormModal.tsx": "Modal for adding products with validation, category/size selection, price input, and image upload handling.",
  "frontend/src/components/ProductsPage.tsx": "Displays a products list with loading, error, and empty states, and provides UI for adding products and navigating back to the dashboard.",
  "frontend/src/components/QuantityPromptModal.tsx": "Modal that prompts the user to enter a quantity for a selected product and shows pricing details before confirming.",
  "frontend/src/components/QueryErrorState.tsx": "Reusable error display component that detects auth-related errors and provides retry functionality.",
  "frontend/src/components/TransactionPage.tsx": "Handles cart and payment flow for recording sales, including product selection, quantity input, and submitting transactions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller’s backend role with safe fallbacks and avoids UI gating based on role retrieval failures.",
  "frontend/src/hooks/useDashboardSummary.ts": "Retrieves dashboard summary data from the backend using the initialized actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login and logout handling, and persistent identity loading.",
  "frontend/src/hooks/useInventory.ts": "Provides React Query hooks to list, add, update, and adjust inventory items via the actor API, with cache invalidation on success.",
  "frontend/src/hooks/useProducts.ts": "Defines hooks for fetching products and adding a new product through the actor API with React Query caching.",
  "frontend/src/hooks/useRecordSale.ts": "Creates a mutation hook to record sales and refresh dashboard summary data after submission.",
  "frontend/src/index.css": "Tailwind base setup defining light/dark OKLCH color variables and global styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and loads global styles.",
  "frontend/src/utils/inventoryName.ts": "Utilities for normalizing inventory item names and checking for duplicates with optional ID exclusion.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters with hash and query support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending color tokens, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Describes the current project state, requirements, issues, and architectural notes for the app rebuild."
}