{
  "backend/main.mo": "Motoko canister defining products, inventory, sales, user profiles, cash transactions, and access-controlled CRUD operations using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend changes, associated files, components, and test IDs for two product-related features.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend components, pages, hooks, and utilities describing their functionality and UI behavior.",
  "frontend/index.css": "Tailwind base theme configuration defining OKLCH color tokens and dark mode overrides for the frontend.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app container managing view routing, query client setup, navbar rendering, and footer attribution.",
  "frontend/src/components/AdjustStockModal.tsx": "Modal component for adding or reducing inventory stock with validation, backend mutation, and normalized error handling.",
  "frontend/src/components/Dashboard.tsx": "Dashboard showing daily revenue, payment method totals, inventory data, low-stock detection, and authentication-aware error states.",
  "frontend/src/components/EditInventoryItemModal.tsx": "Modal for editing an existing inventory item with validation and update mutation handling.",
  "frontend/src/components/EditSaleModal.tsx": "Modal for editing a sale record, allowing item quantity/price changes and updating the transaction.",
  "frontend/src/components/InventoryFormModal.tsx": "Form modal for creating new inventory items with validation, stock calculations, and add mutation.",
  "frontend/src/components/InventoryPage.tsx": "Main inventory page that lists items, handles add/edit/adjust-stock modals, and manages loading/error states.",
  "frontend/src/components/InventoryReportPage.tsx": "Displays stock adjustment history with error handling and formatted report data.",
  "frontend/src/components/LowStockWarningDialog.tsx": "Dialog showing a list of inventory items that are at or below minimum stock levels.",
  "frontend/src/components/Navbar.tsx": "Provides a top navigation bar with logo and menu items, including a dropdown for report-related views.",
  "frontend/src/components/ProductFormModal.tsx": "Modal form for adding new products, supporting image upload, validation, and submission via addProduct hook.",
  "frontend/src/components/ProductsPage.tsx": "Displays the product catalog with loading/error states and provides controls to add products or navigate back.",
  "frontend/src/components/QuantityPromptModal.tsx": "Prompts the user to input quantity for a selected product and shows price details before confirmation.",
  "frontend/src/components/QueryErrorState.tsx": "Shows a standardized error message with retry functionality using normalized error metadata.",
  "frontend/src/components/SalesReportPage.tsx": "Displays sales reports with date filtering, editing, deleting, exporting, and error handling.",
  "frontend/src/components/SignInRequiredState.tsx": "Shows a sign-in prompt using Internet Identity when a feature requires authentication.",
  "frontend/src/components/StockDeductionRulesModal.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/TransactionPage.tsx": "Implements a transaction workflow with cart management, payment selection, and sale recording using backend hooks and modals.",
  "frontend/src/constants/productOptions.ts": "Defines constant lists of product categories, sizes, and names with associated TypeScript types.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous backend actor and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller’s backend role with safe fallbacks and warns against using it for UI gating.",
  "frontend/src/hooks/useDashboardSummary.ts": "Retrieves dashboard summary data from the backend via an authenticated actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity loading, and authentication context management.",
  "frontend/src/hooks/useInvalidateActorQueries.ts": "Provides a helper to invalidate all actor‑related queries for refresh or retry scenarios.",
  "frontend/src/hooks/useInventory.ts": "Fetches inventory items and provides mutations to add, update, and adjust inventory stock.",
  "frontend/src/hooks/useInventoryReport.ts": "Fetches filtered inventory history reports using the anonymous public actor.",
  "frontend/src/hooks/useProducts.ts": "Loads product data and provides a mutation to add new products.",
  "frontend/src/hooks/usePublicActor.ts": "Creates and manages an anonymous backend actor and refreshes dependent queries on actor changes.",
  "frontend/src/hooks/useRecordSale.ts": "Provides a mutation to record sales and invalidates dashboard and inventory queries on success.",
  "frontend/src/hooks/useSalesMutations.ts": "Provides mutations to update or delete sales and refresh relevant reports and summaries.",
  "frontend/src/hooks/useSalesReport.ts": "Queries sales records within a timestamp range using an authenticated actor.",
  "frontend/src/hooks/useStockDeductionRules.ts": "File exists but contains no implementation.",
  "frontend/src/index.css": "Configures Tailwind layers and defines extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider.",
  "frontend/src/utils/errorMessage.ts": "Provides a function to normalize backend errors into user-friendly messages with auth detection.",
  "frontend/src/utils/exportToXls.ts": "Generates an Excel-compatible HTML table from sales data and triggers a .xls file download.",
  "frontend/src/utils/inventoryName.ts": "Supplies helpers for normalizing inventory names and checking for duplicates with optional ID exclusion.",
  "frontend/src/utils/salesFormat.ts": "Formats currency, timestamps, and payment method labels for sales display.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL or session parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and themes using CSS variables and plugins.",
  "project_state.json": "Defines the project state, feature requests, and known issues for the Product Catalog app."
}