{
  "backend/main.mo": "Motoko canister defining products, inventory, sales, expenses, cash transactions, user profiles, and access‑controlled CRUD operations with authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend React components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light and dark themes using custom OKLCH color values.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app shell handling navigation between pages, wrapping content in a QueryClientProvider, and rendering a footer.",
  "frontend/src/components/AdjustStockModal.tsx": "Modal component for increasing or reducing inventory stock with validation, normalized error messages, and backend mutation handling.",
  "frontend/src/components/Dashboard.tsx": "Renders the main dashboard showing sales summary, revenue, payment method totals, and low stock alerts with authentication and loading/error states.",
  "frontend/src/components/EditInventoryItemModal.tsx": "Provides a modal form for editing an inventory item with validation, duplicate-name checks, and mutation handling.",
  "frontend/src/components/EditSaleModal.tsx": "Displays a modal to edit a sale’s payment method and items, including validation, item adjustments, and updating totals.",
  "frontend/src/components/ExpenseReportPage.tsx": "Shows a report of expenses with authentication checks, total calculation, table display, and loading/error handling.",
  "frontend/src/components/ExpensesPage.tsx": "Offers a form for adding new expense records with validation, auto-calculated totals, and submission via mutation.",
  "frontend/src/components/InventoryFormModal.tsx": "Modal form for creating inventory items with validation, error normalization, and automatic stock calculations.",
  "frontend/src/components/InventoryPage.tsx": "Main inventory management page with item listing, creation, editing, stock adjustments, and authentication handling.",
  "frontend/src/components/InventoryReportPage.tsx": "Displays inventory change history with filtering options, authentication checks, and error/loading states.",
  "frontend/src/components/LowStockBanner.tsx": "Shows a warning banner listing inventory items that are below minimum stock levels.",
  "frontend/src/components/LowStockWarningDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/Navbar.tsx": "Top navigation bar with menu items and dropdowns for switching between views.",
  "frontend/src/components/ProductFormModal.tsx": "Modal for adding new products with image upload, validation, and error handling.",
  "frontend/src/components/ProductsPage.tsx": "Displays the product catalog with loading, error, empty state, and authentication handling, and allows opening a modal to add products.",
  "frontend/src/components/QuantityPromptModal.tsx": "Modal for entering product quantity, showing price details and confirming item addition.",
  "frontend/src/components/QueryErrorState.tsx": "Shows normalized error messages with retry handling and special states for auth-related errors.",
  "frontend/src/components/SalesReportPage.tsx": "Displays sales reports with filtering, export, edit/delete actions, and authentication gating.",
  "frontend/src/components/SignInRequiredState.tsx": "Reusable UI prompting the user to sign in via Internet Identity with a login button.",
  "frontend/src/components/StockDeductionRulesModal.tsx": "Empty placeholder file for a future stock deduction rules modal.",
  "frontend/src/components/TransactionPage.tsx": "Handles creating sales transactions with cart management, quantity prompts, checkout logic, and auth checks.",
  "frontend/src/constants/productOptions.ts": "Defines shared constants and types for product categories, sizes, and names.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on authentication state and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller's backend role with a safe 'user' fallback and warns not to use it for UI gating.",
  "frontend/src/hooks/useDashboardSummary.ts": "Loads dashboard summary data from the backend when the actor is ready.",
  "frontend/src/hooks/useExpenses.ts": "Provides queries and mutations for fetching expense records and adding new expense entries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity, login, logout, and status through a context provider.",
  "frontend/src/hooks/useInvalidateActorQueries.ts": "Invalidates and refetches the actor query and all dependent queries.",
  "frontend/src/hooks/useInventory.ts": "Fetches inventory items and provides mutations to add, update, or adjust inventory stock with cache invalidation.",
  "frontend/src/hooks/useInventoryReport.ts": "Retrieves filtered inventory report entries based on text filter and time range.",
  "frontend/src/hooks/useProducts.ts": "Loads product list and provides a mutation for adding new products.",
  "frontend/src/hooks/usePublicActor.ts": "Creates and maintains an anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useRecordSale.ts": "Submits a new sale and invalidates dashboard and inventory data afterward.",
  "frontend/src/hooks/useSalesMutations.ts": "Provides mutations for updating and deleting sales and invalidates sales and dashboard queries.",
  "frontend/src/hooks/useSalesReport.ts": "Fetches sales records within a given timestamp range.",
  "frontend/src/hooks/useStockDeductionRules.ts": "Empty file with no implementation.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles, theme variables, and light/dark mode palettes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/utils/errorMessage.ts": "Normalizes backend error messages into user-friendly titles and messages, detecting auth, network, timeout, and connection issues.",
  "frontend/src/utils/exportToXls.ts": "Generates an HTML-based Excel file from sales line items and triggers a download with a timestamped filename.",
  "frontend/src/utils/inventoryName.ts": "Provides functions to normalize inventory item names and detect duplicates in a list, with optional ID exclusion.",
  "frontend/src/utils/lowStock.ts": "Determines whether inventory items are below minimum stock and filters lists to only low‑stock items.",
  "frontend/src/utils/salesFormat.ts": "Formats currency, timestamps, and payment method labels for sales display using Indonesian locale rules.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read, persist, and clear URL parameters across routing modes and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins including typography and container queries.",
  "project_state.json": "Describes project state, issues, and existing features related to authentication actors, error handling, and retry mechanisms."
}