{
  "backend/main.mo": "IC canister managing products, inventory, sales, stock rules, cash transactions, user profiles, and stock adjustments with access control and blob storage.",
  "feature_evidence.json": "Feature evidence report linking a low‑stock color update to frontend/src/index.css with metadata and test ID.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including pages, hooks, modals, and global styles.",
  "frontend/index.css": "Root Tailwind OKLCH color variables defining theme tokens for light and dark modes with radius, background, foreground, and accent settings.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app managing view routing, layout, and global QueryClientProvider with navbar and footer.",
  "frontend/src/components/AdjustStockModal.tsx": "Modal for adjusting inventory stock with validation, mutation call, error normalization, and description requirement.",
  "frontend/src/components/Dashboard.tsx": "Dashboard showing revenue, quantities, payment summaries, low‑stock banner, and inventory-driven UI using React Query.",
  "frontend/src/components/EditInventoryItemModal.tsx": "Modal form to edit an inventory item with validation, duplicate name checks, and update mutation handling.",
  "frontend/src/components/EditSaleModal.tsx": "Modal to edit an existing sale, allowing item adjustments, validation, and submitting updates via mutation.",
  "frontend/src/components/InventoryFormModal.tsx": "Form modal for creating new inventory items with stock calculations, validation, and duplicate name checks.",
  "frontend/src/components/InventoryPage.tsx": "Main inventory page showing inventory list with add, adjust, and edit actions plus loading and error states.",
  "frontend/src/components/InventoryReportPage.tsx": "Page displaying inventory adjustment history with filters, loading/error handling, and tabular report output.",
  "frontend/src/components/LowStockBanner.tsx": "Banner showing a table of low‑stock inventory items requiring attention.",
  "frontend/src/components/LowStockWarningDialog.tsx": "Empty or placeholder component file.",
  "frontend/src/components/Navbar.tsx": "Renders the main navbar with view switching and a dropdown for report-related submenu items.",
  "frontend/src/components/ProductFormModal.tsx": "Provides a modal form to add a new product, including image upload and validation.",
  "frontend/src/components/ProductsPage.tsx": "Displays the product catalog with loading/error states and allows opening the add‑product modal.",
  "frontend/src/components/QuantityPromptModal.tsx": "Shows a modal for entering quantity when adding a product, with subtotal calculation.",
  "frontend/src/components/QueryErrorState.tsx": "Reusable error display component with normalized messages and a retry button.",
  "frontend/src/components/SalesReportPage.tsx": "Loads and displays sales reports with edit/delete actions and Excel export support.",
  "frontend/src/components/SignInRequiredState.tsx": "Shows a sign‑in prompt with Internet Identity when authentication is required.",
  "frontend/src/components/StockDeductionRulesModal.tsx": "Empty or missing content; no functionality defined.",
  "frontend/src/components/TransactionPage.tsx": "Implements the transaction UI, managing cart state, quantity prompts, checkout logic, and sale recording via backend mutations.",
  "frontend/src/constants/productOptions.ts": "Defines constant lists of product categories, sizes, and names along with related TypeScript types.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous backend actor and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller's backend role with safe fallbacks, intended only for informational purposes.",
  "frontend/src/hooks/useDashboardSummary.ts": "Queries the backend for dashboard summary metrics using an anonymous actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, identity persistence, and related state.",
  "frontend/src/hooks/useInvalidateActorQueries.ts": "Exposes a helper to invalidate all actor-related queries for retrying requests.",
  "frontend/src/hooks/useInventory.ts": "Provides queries and mutations for listing, adding, updating, and adjusting inventory via backend actor.",
  "frontend/src/hooks/useInventoryReport.ts": "Queries filtered inventory report entries from the backend.",
  "frontend/src/hooks/useProducts.ts": "Fetches product list and provides mutation for adding new products.",
  "frontend/src/hooks/usePublicActor.ts": "Creates and maintains an anonymous backend actor and refreshes dependent queries when it updates.",
  "frontend/src/hooks/useRecordSale.ts": "Handles recording new sales and invalidates dashboard and inventory data after success.",
  "frontend/src/hooks/useSalesMutations.ts": "Provides mutations to update or delete sales and refresh sales reports and dashboard data.",
  "frontend/src/hooks/useSalesReport.ts": "Queries sales records within a given timestamp range using a public actor.",
  "frontend/src/hooks/useStockDeductionRules.ts": "File exists but contains no implementation.",
  "frontend/src/index.css": "Defines Tailwind layers and many CSS variables for light/dark themes and UI components.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/utils/errorMessage.ts": "Normalizes various backend error messages into user-friendly titles and texts.",
  "frontend/src/utils/exportToXls.ts": "Generates an Excel-compatible HTML table from sales line items and triggers file download.",
  "frontend/src/utils/inventoryName.ts": "Provides name normalization and duplicate‑checking utilities for inventory items.",
  "frontend/src/utils/salesFormat.ts": "Formats currency, dates, and payment method labels for sales data.",
  "frontend/src/utils/urlParams.ts": "Handles extracting, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, color tokens, animations, and plugins for the project.",
  "project_state.json": "Stores project metadata, feature tracking, and state management for the Sales Inventory Dashboard."
}