{
  "backend/main.mo": "Main canister actor defining product, inventory, sales, rules, cash transactions, and user profile storage with CRUD-like methods and access control mixins.",
  "backend/migration.mo": "Migration stub providing a no-op state migration from old to new actor structures.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color variables for light and dark modes and global styling tokens.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main application shell managing view state, query client, navbar, routed page rendering, and footer attribution.",
  "frontend/src/components/AdjustStockModal.tsx": "Modal form for adding or reducing inventory stock with validation, error normalization, and backend mutation integration.",
  "frontend/src/components/Dashboard.tsx": "Renders the dashboard with daily sales summary, payment method totals, and automatic low‑stock detection. Handles loading, error states, and inventory-based alerts.",
  "frontend/src/components/EditInventoryItemModal.tsx": "Provides a modal for editing an inventory item with validation, duplicate-name checks, and update mutation handling. Pre-fills fields and normalizes error messages.",
  "frontend/src/components/EditSaleModal.tsx": "Modal for editing a sale’s items and payment method, including quantity/price validation and update submission. Displays calculated totals and supports item removal.",
  "frontend/src/components/InventoryFormModal.tsx": "Form modal for adding new inventory items with validation, duplicate-name checks, and auto-calculated final stock. Submits data via an add-inventory mutation.",
  "frontend/src/components/InventoryPage.tsx": "Main inventory management page showing the inventory table, add/edit/adjust stock modals, and low-stock highlighting. Handles loading, errors, and data refresh.",
  "frontend/src/components/InventoryReportPage.tsx": "Displays inventory adjustment history with filters, loading/error states, and a table of report entries.",
  "frontend/src/components/LowStockWarningDialog.tsx": "Shows a dialog listing items at or below minimum stock with a scrollable table layout.",
  "frontend/src/components/Navbar.tsx": "Renders the top navigation bar with main menu items, dropdowns, and view switching logic.",
  "frontend/src/components/ProductFormModal.tsx": "Modal form for adding new products, handling image upload, validation, and submission to backend.",
  "frontend/src/components/ProductsPage.tsx": "Displays product catalog with loading/error states and allows opening the add-product modal.",
  "frontend/src/components/QuantityPromptModal.tsx": "Prompts the user for a quantity when adding a product, calculating subtotal and confirming selection.",
  "frontend/src/components/QueryErrorState.tsx": "Reusable error display component showing normalized messages and a retry button.",
  "frontend/src/components/SalesReportPage.tsx": "Renders the sales report UI with date filtering, export to Excel, editing and deleting sales, and totals computation.",
  "frontend/src/components/SignInRequiredState.tsx": "Displays a prompt for users to sign in via Internet Identity with a login button and loading state.",
  "frontend/src/components/StockDeductionRulesModal.tsx": "Empty file placeholder for stock deduction rules modal.",
  "frontend/src/components/TransactionPage.tsx": "Provides a transaction interface for selecting products, managing a cart, and recording sales with payment methods.",
  "frontend/src/constants/productOptions.ts": "Defines constant lists and types for product categories, sizes, and names used across the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors and invalidates dependent queries on change.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches caller role from the backend with a safe fallback and warns not to use it for UI gating.",
  "frontend/src/hooks/useDashboardSummary.ts": "Fetches dashboard summary data from the backend using the public actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/useInvalidateActorQueries.ts": "Provides a helper to invalidate all actor-related react-query queries.",
  "frontend/src/hooks/useInventory.ts": "Provides queries and mutations for listing, adding, updating, and adjusting inventory items via the backend actor.",
  "frontend/src/hooks/useInventoryReport.ts": "Fetches inventory reports via react-query using the public actor with optional filters and date range.",
  "frontend/src/hooks/useProducts.ts": "Provides product list fetching and a mutation to add products, invalidating the products cache on success.",
  "frontend/src/hooks/usePublicActor.ts": "Creates and manages an anonymous backend actor and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useRecordSale.ts": "Provides a mutation to record sales and invalidates dashboard and inventory queries after success.",
  "frontend/src/hooks/useSalesMutations.ts": "Contains mutations to update or delete sales, invalidating sales and dashboard data afterward.",
  "frontend/src/hooks/useSalesReport.ts": "Fetches sales records for a given time range using the public actor.",
  "frontend/src/hooks/useStockDeductionRules.ts": "Empty file with no implementation.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/errorMessage.ts": "Converts backend errors into normalized user-friendly messages with categorized titles.",
  "frontend/src/utils/exportToXls.ts": "Generates an HTML-based XLS file from sales line items and triggers a download.",
  "frontend/src/utils/inventoryName.ts": "Provides utilities for normalizing inventory names and detecting duplicates.",
  "frontend/src/utils/salesFormat.ts": "Formats currency, dates, and payment method labels for sales data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH-based color tokens, container settings, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's shared-data architecture, current features, and pending requests focused on removing login requirements and ensuring a global dataset accessible to all users."
}