{
  "backend/main.mo": "Motoko canister implementing products, inventory, sales, rules, user profiles, and cash transactions with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report describing one frontend feature with linked files, components, test IDs, and confidence level.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend source files detailing their responsibilities and recent enhancements.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "HTML entry point containing root div and script loading the Vite React app.",
  "frontend/src/App.tsx": "Main React app controlling navigation, wrapping pages with QueryClientProvider, and rendering footer attribution.",
  "frontend/src/components/AdjustStockModal.tsx": "Modal for adding or reducing inventory stock with validation, error normalization, and backend mutation calls.",
  "frontend/src/components/Dashboard.tsx": "Dashboard showing sales summary, payment totals, low‑stock detection, and authentication‑aware error handling.",
  "frontend/src/components/EditInventoryItemModal.tsx": "Modal for editing an existing inventory item with validation, duplicate name checks, and update mutation handling.",
  "frontend/src/components/EditSaleModal.tsx": "Modal to edit a sale record, allowing item quantity/price updates, item removal, and submission via updateSale mutation.",
  "frontend/src/components/InventoryFormModal.tsx": "Form modal for creating new inventory items with validation, duplicate checks, stock calculations, and addInventory mutation.",
  "frontend/src/components/InventoryPage.tsx": "Main inventory page showing item list, loading/error states, and controls for adding, editing, and adjusting stock.",
  "frontend/src/components/InventoryReportPage.tsx": "Page displaying inventory adjustment history with error handling and simple date formatting.",
  "frontend/src/components/LowStockWarningDialog.tsx": "Dialog that lists inventory items below minimum stock thresholds with basic item details.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component with logo, main menu items, and a dropdown submenu for reports, triggering view changes.",
  "frontend/src/components/ProductFormModal.tsx": "Modal form for adding new products, handling image uploads, validation, and authenticated submission.",
  "frontend/src/components/ProductsPage.tsx": "Page showing product list with loading and error states, plus controls to add products and navigate back to the dashboard.",
  "frontend/src/components/QuantityPromptModal.tsx": "Modal asking for product quantity, calculating subtotal, and confirming the selection.",
  "frontend/src/components/QueryErrorState.tsx": "Reusable error display component showing normalized error details and a retry button.",
  "frontend/src/components/SalesReportPage.tsx": "Sales report page with date filtering, table generation, export to XLS, and sale editing/deletion flows.",
  "frontend/src/components/SignInRequiredState.tsx": "UI state prompting users to sign in with Internet Identity, showing login progress.",
  "frontend/src/components/StockDeductionRulesModal.tsx": "Empty placeholder file for a stock deduction rules modal.",
  "frontend/src/components/TransactionPage.tsx": "Implements a two-step cart and payment UI for recording sales, managing cart items, quantities, and submitting the sale via backend hooks.",
  "frontend/src/constants/productOptions.ts": "Defines constant arrays and types for product categories and sizes used across product-related features.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous backend actor and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller's role with safe fallbacks and warnings, intended only for informational backend compatibility.",
  "frontend/src/hooks/useDashboardSummary.ts": "Queries the backend for dashboard summary data using an authenticated actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, and identity restoration.",
  "frontend/src/hooks/useInvalidateActorQueries.ts": "Exposes a function to invalidate all actor-related queries for refreshing backend interactions.",
  "frontend/src/hooks/useInventory.ts": "Provides hooks to list, add, update, and adjust inventory items via backend actor with query invalidation.",
  "frontend/src/hooks/useInventoryReport.ts": "Fetches inventory report entries using a public actor with optional filtering parameters.",
  "frontend/src/hooks/useProducts.ts": "Fetches product list and supports adding products, invalidating product queries on changes.",
  "frontend/src/hooks/usePublicActor.ts": "Creates and manages a public anonymous actor and refreshes dependent queries when it updates.",
  "frontend/src/hooks/useRecordSale.ts": "Provides a mutation to record a sale and invalidates dashboard and inventory queries after success.",
  "frontend/src/hooks/useSalesMutations.ts": "Contains mutations to update or delete sales, refreshing sales reports and dashboard data on success.",
  "frontend/src/hooks/useSalesReport.ts": "Fetches sales records within a timestamp range using an authenticated actor.",
  "frontend/src/hooks/useStockDeductionRules.ts": "File is empty or truncated; no functionality is present.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes and global styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/errorMessage.ts": "Normalizes backend errors into user-friendly messages with auth and network detection.",
  "frontend/src/utils/exportToXls.ts": "Generates an Excel-compatible HTML table for sales report data and triggers file download.",
  "frontend/src/utils/inventoryName.ts": "Provides utilities for normalizing inventory item names and detecting duplicates.",
  "frontend/src/utils/salesFormat.ts": "Formats currency, dates, and payment method labels for sales-related UI.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, animations, and plugins.",
  "project_state.json": "Stores project metadata, feature requests, issues, and architectural notes for the Inventory Report system."
}