{
  "kind": "build_request",
  "title": "Fix product name dropdown to show 5 visible items with scroll and use provided product list",
  "projectName": "Product Catalog",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the static product name options to exactly match the 13 product names provided in chat, and expose them from the existing frontend constants module.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-products-list"
        ],
        "quotes": [
          "1. Es Teh Ori Kecil 2. Es Teh Ori Besar 3. Kopi Aren Ori Kecil 4. Kopi Aren Ori Besar 5. Creamy Latte Kecil 6. Creamy Latte Besar 7. Matcha Latte Kecil 8. Choco Melt Kecil 9. Lemon Tea Kecil 10. Lemon Tea Besar 11. Lemon Fresh Kecil 12. Lemon Fresh Besar 13. Es Batu Cup Besar"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/constants/productOptions.ts` exports a `PRODUCT_NAMES` list containing exactly these 13 strings (spelling/casing must match chat exactly): Es Teh Ori Kecil; Es Teh Ori Besar; Kopi Aren Ori Kecil; Kopi Aren Ori Besar; Creamy Latte Kecil; Creamy Latte Besar; Matcha Latte Kecil; Choco Melt Kecil; Lemon Tea Kecil; Lemon Tea Besar; Lemon Fresh Kecil; Lemon Fresh Besar; Es Batu Cup Besar",
        "No extra legacy product names remain in `PRODUCT_NAMES` (e.g., remove items not present in the 13-name list)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the “Add New Product” modal, make the Product Name dropdown use the provided chat product list, and ensure the dropdown shows approximately 5 items at a time with vertical scrolling enabled for the remaining items (not limited to ~3 visible items).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-scroll-request",
          "msg-user-products-list"
        ],
        "quotes": [
          "Saya mau, ukuran drop down cukup untuk 5 nama, nama produk yang lain dimunculkan dengan scroll up/dwon.",
          "1. Es Teh Ori Kecil 2. Es Teh Ori Besar 3. Kopi Aren Ori Kecil 4. Kopi Aren Ori Besar 5. Creamy Latte Kecil 6. Creamy Latte Besar 7. Matcha Latte Kecil 8. Choco Melt Kecil 9. Lemon Tea Kecil 10. Lemon Tea Besar 11. Lemon Fresh Kecil 12. Lemon Fresh Besar 13. Es Batu Cup Besar"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/ProductFormModal.tsx` imports and uses `PRODUCT_NAMES` to populate the Product Name `<Select>` options (the dropdown is not dependent on `useProducts()` returning previously-created products).",
        "When the Product Name dropdown is opened, about 5 options are visible without scrolling, and the remaining options are accessible via mouse wheel/trackpad scroll inside the dropdown.",
        "The dropdown is not visually truncated to ~3 visible items on common viewport sizes; it has a fixed max height (around 250px) and `overflow-y-auto` applied to the actual scroll container used by the select dropdown."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (shadcn UI components); implement fixes by composing/overriding via props/classes in app components instead.",
    "Keep the backend as a single Motoko actor; no new backend canisters/services."
  ],
  "nonGoals": [
    "Do not add a new UI/admin screen to manage product name lists dynamically.",
    "Do not implement pagination, search, or async loading for the product name dropdown unless required to make scrolling work."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}