{
  "kind": "build_request",
  "title": "Populate Product Name dropdown from backend and make it scrollable",
  "projectName": "Product Catalog",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Product Form modal so the Product Name dropdown options are populated from backend product data (actor.listProducts via the existing React Query products query) instead of using the hardcoded PRODUCT_NAMES constant.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "List Nama produk dalam form produk baru, aktifkan scroll up/down, karena nama produk cukup banyak",
          "1. dari data backend yang ada dalam dropdown"
        ]
      },
      "acceptanceCriteria": [
        "In ProductFormModal, the Product Name Select renders options derived from the backend products list (e.g., product.name).",
        "The hardcoded PRODUCT_NAMES constant is no longer used for the Product Name dropdown options.",
        "The dropdown handles backend loading and error states without crashing (e.g., disables the select and/or shows a simple message/state while loading or on error)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make the Product Name dropdown a long dropdown with default internal scrolling when there are many options by constraining the dropdown content height and enabling overflow scrolling on the dropdown list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "2. dropdown panjang 3. scroll default"
        ]
      },
      "acceptanceCriteria": [
        "When the Product Name options exceed the visible area, the dropdown list becomes vertically scrollable using native/default scrolling behavior.",
        "The dropdown list height is constrained (e.g., via a max-height class on the SelectContent) so it does not expand beyond the viewport."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn components are read-only and must be composed via props/className usage).",
    "Do not change backend canister architecture (single-actor) or add external databases/services."
  ],
  "nonGoals": [
    "Do not change the Category and Size dropdowns behavior or option sets.",
    "Do not implement auto-fill of Category/Size based on the selected Product Name.",
    "Do not change backend schemas or add new backend endpoints unless strictly required for populating the dropdown from existing product data."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}