{
  "kind": "build_request",
  "title": "Fix authentication error on Reports → Inventory Report (stock adjustment history)",
  "projectName": "Natea Fresh POS",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend inventory report query so that opening the Inventory Report page does not require authentication (anonymous users must be able to call `getInventoryReports`).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "di dalam menu laporan, ada sub menu Laporan Inventori. Isinya histori perubahan stok. Ketika di buka, error autentifikasi"
        ]
      },
      "acceptanceCriteria": [
        "Calling `getInventoryReports(filter, daysBack)` with an anonymous principal returns data (or an empty list) and does not trap with an Unauthorized/authentication error.",
        "The backend preserves the existing filter behavior (`filter` matches `description`) and timeframe behavior (`daysBack`) for `getInventoryReports`."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the frontend Inventory Report view loads reliably and does not display any authentication-required error state when opened from Reports → Inventory Report.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Ketika di buka, error autentifikasi"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to Reports → Inventory Report renders the Inventory Report page and attempts to fetch data using the existing anonymous actor flow (no Internet Identity sign-in prompt is shown).",
        "If there are no report entries, the page shows the existing empty state message rather than an authentication error.",
        "If the backend is temporarily unavailable, the page shows the existing connection error UI with a working Retry that re-attempts the query."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not edit the immutable hooks listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`).",
    "Backend must remain a single Motoko actor in `backend/main.mo`; add `backend/migration.mo` only if a state upgrade is required (not expected for this change)."
  ],
  "nonGoals": [
    "Implementing a full login/logout flow or enforcing role-based access control in the UI.",
    "Changing other report submenus (Sales Report, Expense Report, Attendance Report) beyond what is necessary to fix Inventory Report access.",
    "Adding new report types or new inventory history features beyond fixing the current Inventory Report access error."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}