{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Product Catalog — Backend-driven, scrollable Product Name dropdown",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Populate Product Name dropdown options in ProductFormModal from the existing React Query products list (actor.listProducts) and handle loading/error states",
      "acceptanceCriteria": [
        "In ProductFormModal, the Product Name Select renders options derived from the backend products list (e.g., product.name).",
        "The hardcoded PRODUCT_NAMES constant is no longer used for the Product Name dropdown options.",
        "The dropdown handles backend loading and error states without crashing (e.g., disables the select and/or shows a simple message/state while loading or on error)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductFormModal.tsx",
          "operation": "modify",
          "description": "Replace the hardcoded PRODUCT_NAMES-based options with options derived from the existing React Query products query (useProducts / actor.listProducts), mapping to product.name (optionally de-duped/sorted) and adding safe loading/error UI states (e.g., disabled SelectTrigger while loading, simple in-dropdown message on error). Use the shadcn-ui Select/SelectContent composition (read-only ui components via props/className). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Constrain Product Name dropdown list height and enable internal vertical scrolling for many options",
      "acceptanceCriteria": [
        "When the Product Name options exceed the visible area, the dropdown list becomes vertically scrollable using native/default scrolling behavior.",
        "The dropdown list height is constrained (e.g., via a max-height class on the SelectContent) so it does not expand beyond the viewport."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductFormModal.tsx",
          "operation": "modify",
          "description": "Make the Product Name dropdown list scroll by constraining SelectContent height (e.g., max-height) and enabling overflow-y auto on the dropdown list container using className props (do not modify files under frontend/src/components/ui). Use the shadcn-ui SelectContent styling hook points. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}