{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Product Name dropdown options and scrolling in Add New Product modal",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace legacy static product name options with the exact 13 provided names and export them from the existing constants module.",
      "acceptanceCriteria": [
        "`frontend/src/constants/productOptions.ts` exports a `PRODUCT_NAMES` list containing exactly these 13 strings (spelling/casing must match chat exactly): Es Teh Ori Kecil; Es Teh Ori Besar; Kopi Aren Ori Kecil; Kopi Aren Ori Besar; Creamy Latte Kecil; Creamy Latte Besar; Matcha Latte Kecil; Choco Melt Kecil; Lemon Tea Kecil; Lemon Tea Besar; Lemon Fresh Kecil; Lemon Fresh Besar; Es Batu Cup Besar",
        "No extra legacy product names remain in `PRODUCT_NAMES` (e.g., remove items not present in the 13-name list)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/constants/productOptions.ts",
          "operation": "modify",
          "description": "Update `PRODUCT_NAMES` to contain exactly the 13 product names from the BuildRequest (matching spelling/casing exactly) and remove any legacy entries; keep exporting `PRODUCT_NAMES` from this module for reuse across the app."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the Add New Product modal Product Name dropdown use `PRODUCT_NAMES` and ensure the open dropdown shows ~5 items with internal vertical scrolling for the rest.",
      "acceptanceCriteria": [
        "`frontend/src/components/ProductFormModal.tsx` imports and uses `PRODUCT_NAMES` to populate the Product Name `<Select>` options (the dropdown is not dependent on `useProducts()` returning previously-created products).",
        "When the Product Name dropdown is opened, about 5 options are visible without scrolling, and the remaining options are accessible via mouse wheel/trackpad scroll inside the dropdown.",
        "The dropdown is not visually truncated to ~3 visible items on common viewport sizes; it has a fixed max height (around 250px) and `overflow-y-auto` applied to the actual scroll container used by the select dropdown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductFormModal.tsx",
          "operation": "modify",
          "description": "Switch Product Name `<Select>` options to come from `PRODUCT_NAMES` imported from `frontend/src/constants/productOptions.ts` (stop deriving options from `useProducts()`); adjust the Select dropdown styling by applying a fixed max-height (~250px) and `overflow-y-auto` to the actual internal scroll container used by the shadcn Select dropdown (via className composition/overrides on `SelectContent`, without modifying anything under `frontend/src/components/ui`). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}